pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/**
 * \file IfxMtu_reg.h
 * \brief
 * \copyright Copyright (c) 2020 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC33XED_UM_V1.4.0.R0
 * Specification: TC3xx User Manual.V1.4.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Mtu_Registers_Cfg Mtu address
 * \ingroup IfxSfr_Mtu_Registers
 * 
 * \defgroup IfxSfr_Mtu_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Mtu_Registers_Cfg
 *
 * \defgroup IfxSfr_Mtu_Registers_Cfg_Mtu 2-MTU
 * \ingroup IfxSfr_Mtu_Registers_Cfg
 *
 *
 */
#ifndef IFXMTU_REG_H
#define IFXMTU_REG_H 1
/******************************************************************************/
#include "IfxMtu_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Mtu_Registers_Cfg_BaseAddress
 * \{  */

/** \brief MTU object */
#define MODULE_MTU /*lint --e(923, 9078)*/ ((*(Ifx_MTU*)0xF0060000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mtu_Registers_Cfg_Mtu
 * \{  */
/** \brief 0, Clock Control Register */
#define MTU_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_CLC*)0xF0060000u)

/** \brief 8, Identification Register */
#define MTU_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_ID*)0xF0060008u)

/** \brief 10, Memory MBIST Enable Register 0 */
#define MTU_MEMTEST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMTEST0*)0xF0060010u)

/** \brief 14, Memory MBIST Enable Register 1 */
#define MTU_MEMTEST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMTEST1*)0xF0060014u)

/** \brief 18, Memory MBIST Enable Register 2 */
#define MTU_MEMTEST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMTEST2*)0xF0060018u)

/** \brief 1C, Memory Mapping Enable Register */
#define MTU_MEMMAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMMAP*)0xF006001Cu)

/** \brief 38, Memory Status Register 0 */
#define MTU_MEMSTAT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMSTAT0*)0xF0060038u)

/** \brief 3C, Memory Status Register 1 */
#define MTU_MEMSTAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMSTAT1*)0xF006003Cu)

/** \brief 40, Memory Status Register 2 */
#define MTU_MEMSTAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMSTAT2*)0xF0060040u)

/** \brief 50, Memory Test Done Status Register 0 */
#define MTU_MEMDONE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMDONE0*)0xF0060050u)

/** \brief 54, Memory Test Done Status Register 1 */
#define MTU_MEMDONE1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMDONE1*)0xF0060054u)

/** \brief 58, Memory Test Done Status Register 2 */
#define MTU_MEMDONE2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMDONE2*)0xF0060058u)

/** \brief 60, Memory Test FDA Status Register 0 */
#define MTU_MEMFDA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMFDA0*)0xF0060060u)

/** \brief 64, Memory Test FDA Status Register 1 */
#define MTU_MEMFDA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMFDA1*)0xF0060064u)

/** \brief 68, Memory Test FDA Status Register 2 */
#define MTU_MEMFDA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMFDA2*)0xF0060068u)

/** \brief F8, Access Enable Register 1 */
#define MTU_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_ACCEN1*)0xF00600F8u)

/** \brief FC, Access Enable Register 0 */
#define MTU_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_ACCEN0*)0xF00600FCu)

/** \brief 0, Configuration Registers */
#define MTU_MC0_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061000u)

/** \brief 2, Configuration Register 1 */
#define MTU_MC0_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061002u)

/** \brief 4, MBIST Control Register */
#define MTU_MC0_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061004u)

/** \brief 6, Status Register */
#define MTU_MC0_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061006u)

/** \brief 8, Range Register, single address mode */
#define MTU_MC0_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061008u)

/** \brief C, Revision ID Register */
#define MTU_MC0_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006100Cu)

/** \brief E, ECC Safety Register */
#define MTU_MC0_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006100Eu)

/** \brief 10, Memory ECC Detection Register */
#define MTU_MC0_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061010u)

/** \brief 12, Error Tracking Register 0 */
#define MTU_MC0_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061012u)

