pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 210, Memory ECC Detection Register */
#define MTU_MC2_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061210u)

/** \brief 212, Error Tracking Register 0 */
#define MTU_MC2_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061212u)

/** \brief 214, Error Tracking Register 1 */
#define MTU_MC2_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061214u)

/** \brief 216, Error Tracking Register 2 */
#define MTU_MC2_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061216u)

/** \brief 218, Error Tracking Register 3 */
#define MTU_MC2_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061218u)

/** \brief 21A, Error Tracking Register 4 */
#define MTU_MC2_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006121Au)

/** \brief 260, Read Data and Bit Flip Register 0 */
#define MTU_MC2_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061260u)

/** \brief 262, Read Data and Bit Flip Register 1 */
#define MTU_MC2_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061262u)

/** \brief 264, Read Data and Bit Flip Register 2 */
#define MTU_MC2_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061264u)

/** \brief 266, Read Data and Bit Flip Register 3 */
#define MTU_MC2_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061266u)

/** \brief 268, Read Data and Bit Flip Register 4 */
#define MTU_MC2_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061268u)

/** \brief 26A, Read Data and Bit Flip Register 5 */
#define MTU_MC2_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006126Au)

/** \brief 26C, Read Data and Bit Flip Register 6 */
#define MTU_MC2_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006126Cu)

/** \brief 26E, Read Data and Bit Flip Register 7 */
#define MTU_MC2_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006126Eu)

/** \brief 270, Read Data and Bit Flip Register 8 */
#define MTU_MC2_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061270u)

/** \brief 272, Read Data and Bit Flip Register 9 */
#define MTU_MC2_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061272u)

/** \brief 274, Read Data and Bit Flip Register 10 */
#define MTU_MC2_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061274u)

/** \brief 276, Read Data and Bit Flip Register 11 */
#define MTU_MC2_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061276u)

/** \brief 278, Read Data and Bit Flip Register 12 */
#define MTU_MC2_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061278u)

/** \brief 27A, Read Data and Bit Flip Register 13 */
#define MTU_MC2_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006127Au)

/** \brief 27C, Read Data and Bit Flip Register 14 */
#define MTU_MC2_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006127Cu)

/** \brief 27E, Read Data and Bit Flip Register 15 */
#define MTU_MC2_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006127Eu)

/** \brief 280, Read Data and Bit Flip Register 16 */
#define MTU_MC2_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061280u)

/** \brief 282, Read Data and Bit Flip Register 17 */
#define MTU_MC2_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061282u)

/** \brief 284, Read Data and Bit Flip Register 18 */
#define MTU_MC2_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061284u)

/** \brief 286, Read Data and Bit Flip Register 19 */
#define MTU_MC2_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061286u)

/** \brief 288, Read Data and Bit Flip Register 20 */
#define MTU_MC2_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061288u)

/** \brief 28A, Read Data and Bit Flip Register 21 */
#define MTU_MC2_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006128Au)

/** \brief 28C, Read Data and Bit Flip Register 22 */
#define MTU_MC2_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006128Cu)

/** \brief 28E, Read Data and Bit Flip Register 23 */
#define MTU_MC2_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006128Eu)

/** \brief 290, Read Data and Bit Flip Register 24 */
#define MTU_MC2_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061290u)

/** \brief 292, Read Data and Bit Flip Register 25 */
#define MTU_MC2_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061292u)

/** \brief 294, Read Data and Bit Flip Register 26 */
#define MTU_MC2_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061294u)

/** \brief 296, Read Data and Bit Flip Register 27 */
#define MTU_MC2_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061296u)

/** \brief 298, Read Data and Bit Flip Register 28 */
#define MTU_MC2_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061298u)

/** \brief 29A, Read Data and Bit Flip Register 29 */
#define MTU_MC2_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006129Au)

/** \brief 29C, Read Data and Bit Flip Register 30 */
#define MTU_MC2_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006129Cu)

/** \brief 29E, Read Data and Bit Flip Register 31 */
#define MTU_MC2_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006129Eu)

/** \brief 2A0, Read Data and Bit Flip Register 32 */
#define MTU_MC2_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A0u)

/** \brief 2A2, Read Data and Bit Flip Register 33 */
#define MTU_MC2_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A2u)

/** \brief 2A4, Read Data and Bit Flip Register 34 */
#define MTU_MC2_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A4u)

/** \brief 2A6, Read Data and Bit Flip Register 35 */
#define MTU_MC2_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A6u)

/** \brief 2A8, Read Data and Bit Flip Register 36 */
#define MTU_MC2_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612A8u)

/** \brief 2AA, Read Data and Bit Flip Register 37 */
#define MTU_MC2_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612AAu)

/** \brief 2AC, Read Data and Bit Flip Register 38 */
#define MTU_MC2_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612ACu)

/** \brief 2AE, Read Data and Bit Flip Register 39 */
#define MTU_MC2_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612AEu)

/** \brief 2B0, Read Data and Bit Flip Register 40 */
#define MTU_MC2_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00612B0u)

