pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 7CC, Read Data and Bit Flip Register 54 */
#define MTU_MC7_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CCu)

/** \brief 7CE, Read Data and Bit Flip Register 55 */
#define MTU_MC7_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CEu)

/** \brief 7D0, Read Data and Bit Flip Register 56 */
#define MTU_MC7_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D0u)

/** \brief 7D2, Read Data and Bit Flip Register 57 */
#define MTU_MC7_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D2u)

/** \brief 7D4, Read Data and Bit Flip Register 58 */
#define MTU_MC7_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D4u)

/** \brief 7D6, Read Data and Bit Flip Register 59 */
#define MTU_MC7_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D6u)

/** \brief 7D8, Read Data and Bit Flip Register 60 */
#define MTU_MC7_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D8u)

/** \brief 7DA, Read Data and Bit Flip Register 61 */
#define MTU_MC7_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DAu)

/** \brief 7DC, Read Data and Bit Flip Register 62 */
#define MTU_MC7_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DCu)

/** \brief 7DE, Read Data and Bit Flip Register 63 */
#define MTU_MC7_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DEu)

/** \brief 7E0, Read Data and Bit Flip Register 64 */
#define MTU_MC7_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E0u)

/** \brief 7E2, Read Data and Bit Flip Register 65 */
#define MTU_MC7_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E2u)

/** \brief 7E4, Read Data and Bit Flip Register 66 */
#define MTU_MC7_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E4u)

/** \brief 7EE, Alarm Sources Configuration Register */
#define MTU_MC7_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00617EEu)

/** \brief 7F0, SSH Safety Faults Status Register  */
#define MTU_MC7_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00617F0u)

/** \brief 7F2, Error Information Register 0 */
#define MTU_MC7_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F2u)

/** \brief 7F4, Error Information Register 1 */
#define MTU_MC7_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F4u)

/** \brief 7F6, Error Information Register 2 */
#define MTU_MC7_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F6u)

/** \brief 7F8, Error Information Register 3 */
#define MTU_MC7_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F8u)

/** \brief 7FA, Error Information Register 4 */
#define MTU_MC7_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617FAu)

/** \brief 800, Configuration Registers */
#define MTU_MC8_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061800u)

/** \brief 802, Configuration Register 1 */
#define MTU_MC8_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061802u)

/** \brief 804, MBIST Control Register */
#define MTU_MC8_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061804u)

/** \brief 806, Status Register */
#define MTU_MC8_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061806u)

/** \brief 808, Range Register, single address mode */
#define MTU_MC8_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061808u)

/** \brief 80C, Revision ID Register */
#define MTU_MC8_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006180Cu)

/** \brief 80E, ECC Safety Register */
#define MTU_MC8_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006180Eu)

/** \brief 810, Memory ECC Detection Register */
#define MTU_MC8_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061810u)

/** \brief 812, Error Tracking Register 0 */
#define MTU_MC8_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061812u)

/** \brief 814, Error Tracking Register 1 */
#define MTU_MC8_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061814u)

/** \brief 816, Error Tracking Register 2 */
#define MTU_MC8_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061816u)

/** \brief 818, Error Tracking Register 3 */
#define MTU_MC8_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061818u)

/** \brief 81A, Error Tracking Register 4 */
#define MTU_MC8_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006181Au)

/** \brief 860, Read Data and Bit Flip Register 0 */
#define MTU_MC8_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061860u)

/** \brief 862, Read Data and Bit Flip Register 1 */
#define MTU_MC8_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061862u)

/** \brief 864, Read Data and Bit Flip Register 2 */
#define MTU_MC8_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061864u)

/** \brief 866, Read Data and Bit Flip Register 3 */
#define MTU_MC8_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061866u)

/** \brief 868, Read Data and Bit Flip Register 4 */
#define MTU_MC8_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061868u)

/** \brief 86A, Read Data and Bit Flip Register 5 */
#define MTU_MC8_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Au)

/** \brief 86C, Read Data and Bit Flip Register 6 */
#define MTU_MC8_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Cu)

/** \brief 86E, Read Data and Bit Flip Register 7 */
#define MTU_MC8_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Eu)

/** \brief 870, Read Data and Bit Flip Register 8 */
#define MTU_MC8_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061870u)

/** \brief 872, Read Data and Bit Flip Register 9 */
#define MTU_MC8_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061872u)

/** \brief 874, Read Data and Bit Flip Register 10 */
#define MTU_MC8_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061874u)

/** \brief 876, Read Data and Bit Flip Register 11 */
#define MTU_MC8_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061876u)

/** \brief 878, Read Data and Bit Flip Register 12 */
#define MTU_MC8_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061878u)

/** \brief 87A, Read Data and Bit Flip Register 13 */
#define MTU_MC8_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006187Au)

