pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 1492, Read Data and Bit Flip Register 25 */
#define MTU_MC20_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062492u)

/** \brief 1494, Read Data and Bit Flip Register 26 */
#define MTU_MC20_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062494u)

/** \brief 1496, Read Data and Bit Flip Register 27 */
#define MTU_MC20_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062496u)

/** \brief 1498, Read Data and Bit Flip Register 28 */
#define MTU_MC20_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062498u)

/** \brief 149A, Read Data and Bit Flip Register 29 */
#define MTU_MC20_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006249Au)

/** \brief 149C, Read Data and Bit Flip Register 30 */
#define MTU_MC20_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006249Cu)

/** \brief 149E, Read Data and Bit Flip Register 31 */
#define MTU_MC20_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006249Eu)

/** \brief 14A0, Read Data and Bit Flip Register 32 */
#define MTU_MC20_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A0u)

/** \brief 14A2, Read Data and Bit Flip Register 33 */
#define MTU_MC20_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A2u)

/** \brief 14A4, Read Data and Bit Flip Register 34 */
#define MTU_MC20_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A4u)

/** \brief 14A6, Read Data and Bit Flip Register 35 */
#define MTU_MC20_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A6u)

/** \brief 14A8, Read Data and Bit Flip Register 36 */
#define MTU_MC20_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624A8u)

/** \brief 14AA, Read Data and Bit Flip Register 37 */
#define MTU_MC20_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624AAu)

/** \brief 14AC, Read Data and Bit Flip Register 38 */
#define MTU_MC20_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624ACu)

/** \brief 14AE, Read Data and Bit Flip Register 39 */
#define MTU_MC20_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624AEu)

/** \brief 14B0, Read Data and Bit Flip Register 40 */
#define MTU_MC20_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B0u)

/** \brief 14B2, Read Data and Bit Flip Register 41 */
#define MTU_MC20_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B2u)

/** \brief 14B4, Read Data and Bit Flip Register 42 */
#define MTU_MC20_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B4u)

/** \brief 14B6, Read Data and Bit Flip Register 43 */
#define MTU_MC20_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B6u)

/** \brief 14B8, Read Data and Bit Flip Register 44 */
#define MTU_MC20_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624B8u)

/** \brief 14BA, Read Data and Bit Flip Register 45 */
#define MTU_MC20_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624BAu)

/** \brief 14BC, Read Data and Bit Flip Register 46 */
#define MTU_MC20_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624BCu)

/** \brief 14BE, Read Data and Bit Flip Register 47 */
#define MTU_MC20_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624BEu)

/** \brief 14C0, Read Data and Bit Flip Register 48 */
#define MTU_MC20_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C0u)

/** \brief 14C2, Read Data and Bit Flip Register 49 */
#define MTU_MC20_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C2u)

/** \brief 14C4, Read Data and Bit Flip Register 50 */
#define MTU_MC20_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C4u)

/** \brief 14C6, Read Data and Bit Flip Register 51 */
#define MTU_MC20_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C6u)

/** \brief 14C8, Read Data and Bit Flip Register 52 */
#define MTU_MC20_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624C8u)

/** \brief 14CA, Read Data and Bit Flip Register 53 */
#define MTU_MC20_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624CAu)

/** \brief 14CC, Read Data and Bit Flip Register 54 */
#define MTU_MC20_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624CCu)

/** \brief 14CE, Read Data and Bit Flip Register 55 */
#define MTU_MC20_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624CEu)

/** \brief 14D0, Read Data and Bit Flip Register 56 */
#define MTU_MC20_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D0u)

/** \brief 14D2, Read Data and Bit Flip Register 57 */
#define MTU_MC20_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D2u)

/** \brief 14D4, Read Data and Bit Flip Register 58 */
#define MTU_MC20_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D4u)

/** \brief 14D6, Read Data and Bit Flip Register 59 */
#define MTU_MC20_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D6u)

/** \brief 14D8, Read Data and Bit Flip Register 60 */
#define MTU_MC20_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624D8u)

/** \brief 14DA, Read Data and Bit Flip Register 61 */
#define MTU_MC20_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624DAu)

/** \brief 14DC, Read Data and Bit Flip Register 62 */
#define MTU_MC20_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624DCu)

/** \brief 14DE, Read Data and Bit Flip Register 63 */
#define MTU_MC20_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624DEu)

/** \brief 14E0, Read Data and Bit Flip Register 64 */
#define MTU_MC20_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624E0u)

/** \brief 14E2, Read Data and Bit Flip Register 65 */
#define MTU_MC20_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624E2u)

/** \brief 14E4, Read Data and Bit Flip Register 66 */
#define MTU_MC20_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00624E4u)

/** \brief 14EE, Alarm Sources Configuration Register */
#define MTU_MC20_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00624EEu)

