pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 1966, Read Data and Bit Flip Register 3 */
#define MTU_MC25_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062966u)

/** \brief 1968, Read Data and Bit Flip Register 4 */
#define MTU_MC25_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062968u)

/** \brief 196A, Read Data and Bit Flip Register 5 */
#define MTU_MC25_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006296Au)

/** \brief 196C, Read Data and Bit Flip Register 6 */
#define MTU_MC25_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006296Cu)

/** \brief 196E, Read Data and Bit Flip Register 7 */
#define MTU_MC25_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006296Eu)

/** \brief 1970, Read Data and Bit Flip Register 8 */
#define MTU_MC25_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062970u)

/** \brief 1972, Read Data and Bit Flip Register 9 */
#define MTU_MC25_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062972u)

/** \brief 1974, Read Data and Bit Flip Register 10 */
#define MTU_MC25_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062974u)

/** \brief 1976, Read Data and Bit Flip Register 11 */
#define MTU_MC25_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062976u)

/** \brief 1978, Read Data and Bit Flip Register 12 */
#define MTU_MC25_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062978u)

/** \brief 197A, Read Data and Bit Flip Register 13 */
#define MTU_MC25_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006297Au)

/** \brief 197C, Read Data and Bit Flip Register 14 */
#define MTU_MC25_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006297Cu)

/** \brief 197E, Read Data and Bit Flip Register 15 */
#define MTU_MC25_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006297Eu)

/** \brief 1980, Read Data and Bit Flip Register 16 */
#define MTU_MC25_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062980u)

/** \brief 1982, Read Data and Bit Flip Register 17 */
#define MTU_MC25_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062982u)

/** \brief 1984, Read Data and Bit Flip Register 18 */
#define MTU_MC25_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062984u)

/** \brief 1986, Read Data and Bit Flip Register 19 */
#define MTU_MC25_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062986u)

/** \brief 1988, Read Data and Bit Flip Register 20 */
#define MTU_MC25_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062988u)

/** \brief 198A, Read Data and Bit Flip Register 21 */
#define MTU_MC25_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006298Au)

/** \brief 198C, Read Data and Bit Flip Register 22 */
#define MTU_MC25_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006298Cu)

/** \brief 198E, Read Data and Bit Flip Register 23 */
#define MTU_MC25_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006298Eu)

/** \brief 1990, Read Data and Bit Flip Register 24 */
#define MTU_MC25_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062990u)

/** \brief 1992, Read Data and Bit Flip Register 25 */
#define MTU_MC25_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062992u)

/** \brief 1994, Read Data and Bit Flip Register 26 */
#define MTU_MC25_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062994u)

/** \brief 1996, Read Data and Bit Flip Register 27 */
#define MTU_MC25_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062996u)

/** \brief 1998, Read Data and Bit Flip Register 28 */
#define MTU_MC25_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062998u)

/** \brief 199A, Read Data and Bit Flip Register 29 */
#define MTU_MC25_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006299Au)

/** \brief 199C, Read Data and Bit Flip Register 30 */
#define MTU_MC25_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006299Cu)

/** \brief 199E, Read Data and Bit Flip Register 31 */
#define MTU_MC25_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006299Eu)

/** \brief 19A0, Read Data and Bit Flip Register 32 */
#define MTU_MC25_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A0u)

/** \brief 19A2, Read Data and Bit Flip Register 33 */
#define MTU_MC25_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A2u)

/** \brief 19A4, Read Data and Bit Flip Register 34 */
#define MTU_MC25_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A4u)

/** \brief 19A6, Read Data and Bit Flip Register 35 */
#define MTU_MC25_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A6u)

/** \brief 19A8, Read Data and Bit Flip Register 36 */
#define MTU_MC25_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629A8u)

/** \brief 19AA, Read Data and Bit Flip Register 37 */
#define MTU_MC25_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629AAu)

/** \brief 19AC, Read Data and Bit Flip Register 38 */
#define MTU_MC25_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629ACu)

/** \brief 19AE, Read Data and Bit Flip Register 39 */
#define MTU_MC25_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629AEu)

/** \brief 19B0, Read Data and Bit Flip Register 40 */
#define MTU_MC25_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B0u)

/** \brief 19B2, Read Data and Bit Flip Register 41 */
#define MTU_MC25_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B2u)

/** \brief 19B4, Read Data and Bit Flip Register 42 */
#define MTU_MC25_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B4u)

/** \brief 19B6, Read Data and Bit Flip Register 43 */
#define MTU_MC25_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B6u)

