pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 277C, Read Data and Bit Flip Register 14 */
#define MTU_MC39_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006377Cu)

/** \brief 277E, Read Data and Bit Flip Register 15 */
#define MTU_MC39_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006377Eu)

/** \brief 2780, Read Data and Bit Flip Register 16 */
#define MTU_MC39_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063780u)

/** \brief 2782, Read Data and Bit Flip Register 17 */
#define MTU_MC39_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063782u)

/** \brief 2784, Read Data and Bit Flip Register 18 */
#define MTU_MC39_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063784u)

/** \brief 2786, Read Data and Bit Flip Register 19 */
#define MTU_MC39_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063786u)

/** \brief 2788, Read Data and Bit Flip Register 20 */
#define MTU_MC39_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063788u)

/** \brief 278A, Read Data and Bit Flip Register 21 */
#define MTU_MC39_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006378Au)

/** \brief 278C, Read Data and Bit Flip Register 22 */
#define MTU_MC39_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006378Cu)

/** \brief 278E, Read Data and Bit Flip Register 23 */
#define MTU_MC39_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006378Eu)

/** \brief 2790, Read Data and Bit Flip Register 24 */
#define MTU_MC39_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063790u)

/** \brief 2792, Read Data and Bit Flip Register 25 */
#define MTU_MC39_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063792u)

/** \brief 2794, Read Data and Bit Flip Register 26 */
#define MTU_MC39_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063794u)

/** \brief 2796, Read Data and Bit Flip Register 27 */
#define MTU_MC39_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063796u)

/** \brief 2798, Read Data and Bit Flip Register 28 */
#define MTU_MC39_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063798u)

/** \brief 279A, Read Data and Bit Flip Register 29 */
#define MTU_MC39_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006379Au)

/** \brief 279C, Read Data and Bit Flip Register 30 */
#define MTU_MC39_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006379Cu)

/** \brief 279E, Read Data and Bit Flip Register 31 */
#define MTU_MC39_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006379Eu)

/** \brief 27A0, Read Data and Bit Flip Register 32 */
#define MTU_MC39_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A0u)

/** \brief 27A2, Read Data and Bit Flip Register 33 */
#define MTU_MC39_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A2u)

/** \brief 27A4, Read Data and Bit Flip Register 34 */
#define MTU_MC39_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A4u)

/** \brief 27A6, Read Data and Bit Flip Register 35 */
#define MTU_MC39_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A6u)

/** \brief 27A8, Read Data and Bit Flip Register 36 */
#define MTU_MC39_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637A8u)

/** \brief 27AA, Read Data and Bit Flip Register 37 */
#define MTU_MC39_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637AAu)

/** \brief 27AC, Read Data and Bit Flip Register 38 */
#define MTU_MC39_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637ACu)

/** \brief 27AE, Read Data and Bit Flip Register 39 */
#define MTU_MC39_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637AEu)

/** \brief 27B0, Read Data and Bit Flip Register 40 */
#define MTU_MC39_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B0u)

/** \brief 27B2, Read Data and Bit Flip Register 41 */
#define MTU_MC39_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B2u)

/** \brief 27B4, Read Data and Bit Flip Register 42 */
#define MTU_MC39_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B4u)

/** \brief 27B6, Read Data and Bit Flip Register 43 */
#define MTU_MC39_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B6u)

/** \brief 27B8, Read Data and Bit Flip Register 44 */
#define MTU_MC39_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637B8u)

/** \brief 27BA, Read Data and Bit Flip Register 45 */
#define MTU_MC39_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637BAu)

/** \brief 27BC, Read Data and Bit Flip Register 46 */
#define MTU_MC39_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637BCu)

/** \brief 27BE, Read Data and Bit Flip Register 47 */
#define MTU_MC39_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637BEu)

/** \brief 27C0, Read Data and Bit Flip Register 48 */
#define MTU_MC39_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C0u)

/** \brief 27C2, Read Data and Bit Flip Register 49 */
#define MTU_MC39_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C2u)

/** \brief 27C4, Read Data and Bit Flip Register 50 */
#define MTU_MC39_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C4u)

/** \brief 27C6, Read Data and Bit Flip Register 51 */
#define MTU_MC39_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C6u)

/** \brief 27C8, Read Data and Bit Flip Register 52 */
#define MTU_MC39_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637C8u)

/** \brief 27CA, Read Data and Bit Flip Register 53 */
#define MTU_MC39_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637CAu)

/** \brief 27CC, Read Data and Bit Flip Register 54 */
#define MTU_MC39_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637CCu)

/** \brief 27CE, Read Data and Bit Flip Register 55 */
#define MTU_MC39_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637CEu)

/** \brief 27D0, Read Data and Bit Flip Register 56 */
#define MTU_MC39_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D0u)

/** \brief 27D2, Read Data and Bit Flip Register 57 */
#define MTU_MC39_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D2u)

/** \brief 27D4, Read Data and Bit Flip Register 58 */
#define MTU_MC39_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D4u)

/** \brief 27D6, Read Data and Bit Flip Register 59 */
#define MTU_MC39_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D6u)

/** \brief 27D8, Read Data and Bit Flip Register 60 */
#define MTU_MC39_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637D8u)

/** \brief 27DA, Read Data and Bit Flip Register 61 */
#define MTU_MC39_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637DAu)

/** \brief 27DC, Read Data and Bit Flip Register 62 */
#define MTU_MC39_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637DCu)

/** \brief 27DE, Read Data and Bit Flip Register 63 */
#define MTU_MC39_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637DEu)

/** \brief 27E0, Read Data and Bit Flip Register 64 */
#define MTU_MC39_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637E0u)

/** \brief 27E2, Read Data and Bit Flip Register 65 */
#define MTU_MC39_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637E2u)

/** \brief 27E4, Read Data and Bit Flip Register 66 */
#define MTU_MC39_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00637E4u)

/** \brief 27EE, Alarm Sources Configuration Register */
#define MTU_MC39_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00637EEu)

/** \brief 27F0, SSH Safety Faults Status Register  */
#define MTU_MC39_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00637F0u)

/** \brief 27F2, Error Information Register 0 */
#define MTU_MC39_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637F2u)

