pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 2904, MBIST Control Register */
#define MTU_MC41_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063904u)

/** \brief 2906, Status Register */
#define MTU_MC41_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063906u)

/** \brief 2908, Range Register, single address mode */
#define MTU_MC41_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063908u)

/** \brief 290C, Revision ID Register */
#define MTU_MC41_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006390Cu)

/** \brief 290E, ECC Safety Register */
#define MTU_MC41_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006390Eu)

/** \brief 2910, Memory ECC Detection Register */
#define MTU_MC41_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063910u)

/** \brief 2912, Error Tracking Register 0 */
#define MTU_MC41_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063912u)

/** \brief 2914, Error Tracking Register 1 */
#define MTU_MC41_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063914u)

/** \brief 2916, Error Tracking Register 2 */
#define MTU_MC41_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063916u)

/** \brief 2918, Error Tracking Register 3 */
#define MTU_MC41_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063918u)

/** \brief 291A, Error Tracking Register 4 */
#define MTU_MC41_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006391Au)

/** \brief 2960, Read Data and Bit Flip Register 0 */
#define MTU_MC41_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063960u)

/** \brief 2962, Read Data and Bit Flip Register 1 */
#define MTU_MC41_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063962u)

/** \brief 2964, Read Data and Bit Flip Register 2 */
#define MTU_MC41_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063964u)

/** \brief 2966, Read Data and Bit Flip Register 3 */
#define MTU_MC41_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063966u)

/** \brief 2968, Read Data and Bit Flip Register 4 */
#define MTU_MC41_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063968u)

/** \brief 296A, Read Data and Bit Flip Register 5 */
#define MTU_MC41_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006396Au)

/** \brief 296C, Read Data and Bit Flip Register 6 */
#define MTU_MC41_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006396Cu)

/** \brief 296E, Read Data and Bit Flip Register 7 */
#define MTU_MC41_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006396Eu)

/** \brief 2970, Read Data and Bit Flip Register 8 */
#define MTU_MC41_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063970u)

/** \brief 2972, Read Data and Bit Flip Register 9 */
#define MTU_MC41_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063972u)

/** \brief 2974, Read Data and Bit Flip Register 10 */
#define MTU_MC41_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063974u)

/** \brief 2976, Read Data and Bit Flip Register 11 */
#define MTU_MC41_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063976u)

/** \brief 2978, Read Data and Bit Flip Register 12 */
#define MTU_MC41_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063978u)

/** \brief 297A, Read Data and Bit Flip Register 13 */
#define MTU_MC41_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006397Au)

/** \brief 297C, Read Data and Bit Flip Register 14 */
#define MTU_MC41_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006397Cu)

/** \brief 297E, Read Data and Bit Flip Register 15 */
#define MTU_MC41_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006397Eu)

/** \brief 2980, Read Data and Bit Flip Register 16 */
#define MTU_MC41_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063980u)

/** \brief 2982, Read Data and Bit Flip Register 17 */
#define MTU_MC41_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063982u)

/** \brief 2984, Read Data and Bit Flip Register 18 */
#define MTU_MC41_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063984u)

/** \brief 2986, Read Data and Bit Flip Register 19 */
#define MTU_MC41_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063986u)

/** \brief 2988, Read Data and Bit Flip Register 20 */
#define MTU_MC41_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063988u)

/** \brief 298A, Read Data and Bit Flip Register 21 */
#define MTU_MC41_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006398Au)

/** \brief 298C, Read Data and Bit Flip Register 22 */
#define MTU_MC41_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006398Cu)

/** \brief 298E, Read Data and Bit Flip Register 23 */
#define MTU_MC41_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006398Eu)

/** \brief 2990, Read Data and Bit Flip Register 24 */
#define MTU_MC41_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063990u)

/** \brief 2992, Read Data and Bit Flip Register 25 */
#define MTU_MC41_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063992u)

/** \brief 2994, Read Data and Bit Flip Register 26 */
#define MTU_MC41_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063994u)

/** \brief 2996, Read Data and Bit Flip Register 27 */
#define MTU_MC41_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063996u)

/** \brief 2998, Read Data and Bit Flip Register 28 */
#define MTU_MC41_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063998u)

/** \brief 299A, Read Data and Bit Flip Register 29 */
#define MTU_MC41_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006399Au)

/** \brief 299C, Read Data and Bit Flip Register 30 */
#define MTU_MC41_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006399Cu)

/** \brief 299E, Read Data and Bit Flip Register 31 */
#define MTU_MC41_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006399Eu)

