pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 2DC8, Read Data and Bit Flip Register 52 */
#define MTU_MC45_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DC8u)

/** \brief 2DCA, Read Data and Bit Flip Register 53 */
#define MTU_MC45_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DCAu)

/** \brief 2DCC, Read Data and Bit Flip Register 54 */
#define MTU_MC45_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DCCu)

/** \brief 2DCE, Read Data and Bit Flip Register 55 */
#define MTU_MC45_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DCEu)

/** \brief 2DD0, Read Data and Bit Flip Register 56 */
#define MTU_MC45_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD0u)

/** \brief 2DD2, Read Data and Bit Flip Register 57 */
#define MTU_MC45_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD2u)

/** \brief 2DD4, Read Data and Bit Flip Register 58 */
#define MTU_MC45_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD4u)

/** \brief 2DD6, Read Data and Bit Flip Register 59 */
#define MTU_MC45_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD6u)

/** \brief 2DD8, Read Data and Bit Flip Register 60 */
#define MTU_MC45_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DD8u)

/** \brief 2DDA, Read Data and Bit Flip Register 61 */
#define MTU_MC45_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DDAu)

/** \brief 2DDC, Read Data and Bit Flip Register 62 */
#define MTU_MC45_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DDCu)

/** \brief 2DDE, Read Data and Bit Flip Register 63 */
#define MTU_MC45_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DDEu)

/** \brief 2DE0, Read Data and Bit Flip Register 64 */
#define MTU_MC45_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DE0u)

/** \brief 2DE2, Read Data and Bit Flip Register 65 */
#define MTU_MC45_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DE2u)

/** \brief 2DE4, Read Data and Bit Flip Register 66 */
#define MTU_MC45_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063DE4u)

/** \brief 2DEE, Alarm Sources Configuration Register */
#define MTU_MC45_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0063DEEu)

/** \brief 2DF0, SSH Safety Faults Status Register  */
#define MTU_MC45_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0063DF0u)

/** \brief 2DF2, Error Information Register 0 */
#define MTU_MC45_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DF2u)

/** \brief 2DF4, Error Information Register 1 */
#define MTU_MC45_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DF4u)

/** \brief 2DF6, Error Information Register 2 */
#define MTU_MC45_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DF6u)

/** \brief 2DF8, Error Information Register 3 */
#define MTU_MC45_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DF8u)

/** \brief 2DFA, Error Information Register 4 */
#define MTU_MC45_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063DFAu)

/** \brief 2E00, Configuration Registers */
#define MTU_MC46_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063E00u)

/** \brief 2E02, Configuration Register 1 */
#define MTU_MC46_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063E02u)

/** \brief 2E04, MBIST Control Register */
#define MTU_MC46_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063E04u)

/** \brief 2E06, Status Register */
#define MTU_MC46_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063E06u)

/** \brief 2E08, Range Register, single address mode */
#define MTU_MC46_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063E08u)

/** \brief 2E0C, Revision ID Register */
#define MTU_MC46_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063E0Cu)

/** \brief 2E0E, ECC Safety Register */
#define MTU_MC46_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063E0Eu)

/** \brief 2E10, Memory ECC Detection Register */
#define MTU_MC46_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063E10u)

/** \brief 2E12, Error Tracking Register 0 */
#define MTU_MC46_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E12u)

/** \brief 2E14, Error Tracking Register 1 */
#define MTU_MC46_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E14u)

/** \brief 2E16, Error Tracking Register 2 */
#define MTU_MC46_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E16u)

/** \brief 2E18, Error Tracking Register 3 */
#define MTU_MC46_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E18u)

/** \brief 2E1A, Error Tracking Register 4 */
#define MTU_MC46_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063E1Au)

/** \brief 2E60, Read Data and Bit Flip Register 0 */
#define MTU_MC46_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E60u)

/** \brief 2E62, Read Data and Bit Flip Register 1 */
#define MTU_MC46_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E62u)

/** \brief 2E64, Read Data and Bit Flip Register 2 */
#define MTU_MC46_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E64u)

/** \brief 2E66, Read Data and Bit Flip Register 3 */
#define MTU_MC46_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E66u)

/** \brief 2E68, Read Data and Bit Flip Register 4 */
#define MTU_MC46_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E68u)

/** \brief 2E6A, Read Data and Bit Flip Register 5 */
#define MTU_MC46_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E6Au)

/** \brief 2E6C, Read Data and Bit Flip Register 6 */
#define MTU_MC46_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E6Cu)

/** \brief 2E6E, Read Data and Bit Flip Register 7 */
#define MTU_MC46_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E6Eu)

/** \brief 2E70, Read Data and Bit Flip Register 8 */
#define MTU_MC46_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E70u)

/** \brief 2E72, Read Data and Bit Flip Register 9 */
#define MTU_MC46_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E72u)

/** \brief 2E74, Read Data and Bit Flip Register 10 */
#define MTU_MC46_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E74u)

