pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 3960, Read Data and Bit Flip Register 0 */
#define MTU_MC57_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064960u)

/** \brief 3962, Read Data and Bit Flip Register 1 */
#define MTU_MC57_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064962u)

/** \brief 3964, Read Data and Bit Flip Register 2 */
#define MTU_MC57_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064964u)

/** \brief 3966, Read Data and Bit Flip Register 3 */
#define MTU_MC57_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064966u)

/** \brief 3968, Read Data and Bit Flip Register 4 */
#define MTU_MC57_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064968u)

/** \brief 396A, Read Data and Bit Flip Register 5 */
#define MTU_MC57_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006496Au)

/** \brief 396C, Read Data and Bit Flip Register 6 */
#define MTU_MC57_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006496Cu)

/** \brief 396E, Read Data and Bit Flip Register 7 */
#define MTU_MC57_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006496Eu)

/** \brief 3970, Read Data and Bit Flip Register 8 */
#define MTU_MC57_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064970u)

/** \brief 3972, Read Data and Bit Flip Register 9 */
#define MTU_MC57_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064972u)

/** \brief 3974, Read Data and Bit Flip Register 10 */
#define MTU_MC57_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064974u)

/** \brief 3976, Read Data and Bit Flip Register 11 */
#define MTU_MC57_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064976u)

/** \brief 3978, Read Data and Bit Flip Register 12 */
#define MTU_MC57_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064978u)

/** \brief 397A, Read Data and Bit Flip Register 13 */
#define MTU_MC57_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006497Au)

/** \brief 397C, Read Data and Bit Flip Register 14 */
#define MTU_MC57_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006497Cu)

/** \brief 397E, Read Data and Bit Flip Register 15 */
#define MTU_MC57_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006497Eu)

/** \brief 3980, Read Data and Bit Flip Register 16 */
#define MTU_MC57_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064980u)

/** \brief 3982, Read Data and Bit Flip Register 17 */
#define MTU_MC57_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064982u)

/** \brief 3984, Read Data and Bit Flip Register 18 */
#define MTU_MC57_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064984u)

/** \brief 3986, Read Data and Bit Flip Register 19 */
#define MTU_MC57_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064986u)

/** \brief 3988, Read Data and Bit Flip Register 20 */
#define MTU_MC57_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064988u)

/** \brief 398A, Read Data and Bit Flip Register 21 */
#define MTU_MC57_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006498Au)

/** \brief 398C, Read Data and Bit Flip Register 22 */
#define MTU_MC57_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006498Cu)

/** \brief 398E, Read Data and Bit Flip Register 23 */
#define MTU_MC57_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006498Eu)

/** \brief 3990, Read Data and Bit Flip Register 24 */
#define MTU_MC57_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064990u)

/** \brief 3992, Read Data and Bit Flip Register 25 */
#define MTU_MC57_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064992u)

/** \brief 3994, Read Data and Bit Flip Register 26 */
#define MTU_MC57_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064994u)

/** \brief 3996, Read Data and Bit Flip Register 27 */
#define MTU_MC57_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064996u)

/** \brief 3998, Read Data and Bit Flip Register 28 */
#define MTU_MC57_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064998u)

/** \brief 399A, Read Data and Bit Flip Register 29 */
#define MTU_MC57_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006499Au)

/** \brief 399C, Read Data and Bit Flip Register 30 */
#define MTU_MC57_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006499Cu)

/** \brief 399E, Read Data and Bit Flip Register 31 */
#define MTU_MC57_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006499Eu)

/** \brief 39A0, Read Data and Bit Flip Register 32 */
#define MTU_MC57_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A0u)

/** \brief 39A2, Read Data and Bit Flip Register 33 */
#define MTU_MC57_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A2u)

/** \brief 39A4, Read Data and Bit Flip Register 34 */
#define MTU_MC57_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A4u)

/** \brief 39A6, Read Data and Bit Flip Register 35 */
#define MTU_MC57_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A6u)

/** \brief 39A8, Read Data and Bit Flip Register 36 */
#define MTU_MC57_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649A8u)

/** \brief 39AA, Read Data and Bit Flip Register 37 */
#define MTU_MC57_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649AAu)

/** \brief 39AC, Read Data and Bit Flip Register 38 */
#define MTU_MC57_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649ACu)

/** \brief 39AE, Read Data and Bit Flip Register 39 */
#define MTU_MC57_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649AEu)

/** \brief 39B0, Read Data and Bit Flip Register 40 */
#define MTU_MC57_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B0u)

