pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 39B2, Read Data and Bit Flip Register 41 */
#define MTU_MC57_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B2u)

/** \brief 39B4, Read Data and Bit Flip Register 42 */
#define MTU_MC57_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B4u)

/** \brief 39B6, Read Data and Bit Flip Register 43 */
#define MTU_MC57_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B6u)

/** \brief 39B8, Read Data and Bit Flip Register 44 */
#define MTU_MC57_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649B8u)

/** \brief 39BA, Read Data and Bit Flip Register 45 */
#define MTU_MC57_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649BAu)

/** \brief 39BC, Read Data and Bit Flip Register 46 */
#define MTU_MC57_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649BCu)

/** \brief 39BE, Read Data and Bit Flip Register 47 */
#define MTU_MC57_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649BEu)

/** \brief 39C0, Read Data and Bit Flip Register 48 */
#define MTU_MC57_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C0u)

/** \brief 39C2, Read Data and Bit Flip Register 49 */
#define MTU_MC57_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C2u)

/** \brief 39C4, Read Data and Bit Flip Register 50 */
#define MTU_MC57_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C4u)

/** \brief 39C6, Read Data and Bit Flip Register 51 */
#define MTU_MC57_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C6u)

/** \brief 39C8, Read Data and Bit Flip Register 52 */
#define MTU_MC57_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649C8u)

/** \brief 39CA, Read Data and Bit Flip Register 53 */
#define MTU_MC57_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649CAu)

/** \brief 39CC, Read Data and Bit Flip Register 54 */
#define MTU_MC57_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649CCu)

/** \brief 39CE, Read Data and Bit Flip Register 55 */
#define MTU_MC57_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649CEu)

/** \brief 39D0, Read Data and Bit Flip Register 56 */
#define MTU_MC57_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D0u)

/** \brief 39D2, Read Data and Bit Flip Register 57 */
#define MTU_MC57_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D2u)

/** \brief 39D4, Read Data and Bit Flip Register 58 */
#define MTU_MC57_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D4u)

/** \brief 39D6, Read Data and Bit Flip Register 59 */
#define MTU_MC57_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D6u)

/** \brief 39D8, Read Data and Bit Flip Register 60 */
#define MTU_MC57_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649D8u)

/** \brief 39DA, Read Data and Bit Flip Register 61 */
#define MTU_MC57_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649DAu)

/** \brief 39DC, Read Data and Bit Flip Register 62 */
#define MTU_MC57_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649DCu)

/** \brief 39DE, Read Data and Bit Flip Register 63 */
#define MTU_MC57_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649DEu)

/** \brief 39E0, Read Data and Bit Flip Register 64 */
#define MTU_MC57_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649E0u)

/** \brief 39E2, Read Data and Bit Flip Register 65 */
#define MTU_MC57_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649E2u)

/** \brief 39E4, Read Data and Bit Flip Register 66 */
#define MTU_MC57_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00649E4u)

/** \brief 39EE, Alarm Sources Configuration Register */
#define MTU_MC57_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00649EEu)

/** \brief 39F0, SSH Safety Faults Status Register  */
#define MTU_MC57_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00649F0u)

/** \brief 39F2, Error Information Register 0 */
#define MTU_MC57_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649F2u)

/** \brief 39F4, Error Information Register 1 */
#define MTU_MC57_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649F4u)

/** \brief 39F6, Error Information Register 2 */
#define MTU_MC57_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649F6u)

/** \brief 39F8, Error Information Register 3 */
#define MTU_MC57_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649F8u)

/** \brief 39FA, Error Information Register 4 */
#define MTU_MC57_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00649FAu)

/** \brief 3A00, Configuration Registers */
#define MTU_MC58_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064A00u)

/** \brief 3A02, Configuration Register 1 */
#define MTU_MC58_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064A02u)

/** \brief 3A04, MBIST Control Register */
#define MTU_MC58_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064A04u)

/** \brief 3A06, Status Register */
#define MTU_MC58_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064A06u)

/** \brief 3A08, Range Register, single address mode */
#define MTU_MC58_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064A08u)

/** \brief 3A0C, Revision ID Register */
#define MTU_MC58_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064A0Cu)

/** \brief 3A0E, ECC Safety Register */
#define MTU_MC58_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064A0Eu)

/** \brief 3A10, Memory ECC Detection Register */
#define MTU_MC58_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064A10u)

/** \brief 3A12, Error Tracking Register 0 */
#define MTU_MC58_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A12u)

/** \brief 3A14, Error Tracking Register 1 */
#define MTU_MC58_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A14u)

/** \brief 3A16, Error Tracking Register 2 */
#define MTU_MC58_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A16u)

/** \brief 3A18, Error Tracking Register 3 */
#define MTU_MC58_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A18u)

/** \brief 3A1A, Error Tracking Register 4 */
#define MTU_MC58_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064A1Au)

/** \brief 3A60, Read Data and Bit Flip Register 0 */
#define MTU_MC58_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A60u)

/** \brief 3A62, Read Data and Bit Flip Register 1 */
#define MTU_MC58_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A62u)

/** \brief 3A64, Read Data and Bit Flip Register 2 */
#define MTU_MC58_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A64u)

