pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 3BC6, Read Data and Bit Flip Register 51 */
#define MTU_MC59_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC6u)

/** \brief 3BC8, Read Data and Bit Flip Register 52 */
#define MTU_MC59_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC8u)

/** \brief 3BCA, Read Data and Bit Flip Register 53 */
#define MTU_MC59_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BCAu)

/** \brief 3BCC, Read Data and Bit Flip Register 54 */
#define MTU_MC59_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BCCu)

/** \brief 3BCE, Read Data and Bit Flip Register 55 */
#define MTU_MC59_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BCEu)

/** \brief 3BD0, Read Data and Bit Flip Register 56 */
#define MTU_MC59_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD0u)

/** \brief 3BD2, Read Data and Bit Flip Register 57 */
#define MTU_MC59_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD2u)

/** \brief 3BD4, Read Data and Bit Flip Register 58 */
#define MTU_MC59_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD4u)

/** \brief 3BD6, Read Data and Bit Flip Register 59 */
#define MTU_MC59_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD6u)

/** \brief 3BD8, Read Data and Bit Flip Register 60 */
#define MTU_MC59_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BD8u)

/** \brief 3BDA, Read Data and Bit Flip Register 61 */
#define MTU_MC59_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BDAu)

/** \brief 3BDC, Read Data and Bit Flip Register 62 */
#define MTU_MC59_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BDCu)

/** \brief 3BDE, Read Data and Bit Flip Register 63 */
#define MTU_MC59_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BDEu)

/** \brief 3BE0, Read Data and Bit Flip Register 64 */
#define MTU_MC59_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BE0u)

/** \brief 3BE2, Read Data and Bit Flip Register 65 */
#define MTU_MC59_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BE2u)

/** \brief 3BE4, Read Data and Bit Flip Register 66 */
#define MTU_MC59_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BE4u)

/** \brief 3BEE, Alarm Sources Configuration Register */
#define MTU_MC59_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0064BEEu)

/** \brief 3BF0, SSH Safety Faults Status Register  */
#define MTU_MC59_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0064BF0u)

/** \brief 3BF2, Error Information Register 0 */
#define MTU_MC59_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BF2u)

/** \brief 3BF4, Error Information Register 1 */
#define MTU_MC59_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BF4u)

/** \brief 3BF6, Error Information Register 2 */
#define MTU_MC59_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BF6u)

/** \brief 3BF8, Error Information Register 3 */
#define MTU_MC59_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BF8u)

/** \brief 3BFA, Error Information Register 4 */
#define MTU_MC59_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064BFAu)

/** \brief 3C00, Configuration Registers */
#define MTU_MC60_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064C00u)

/** \brief 3C02, Configuration Register 1 */
#define MTU_MC60_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064C02u)

/** \brief 3C04, MBIST Control Register */
#define MTU_MC60_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064C04u)

/** \brief 3C06, Status Register */
#define MTU_MC60_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064C06u)

/** \brief 3C08, Range Register, single address mode */
#define MTU_MC60_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064C08u)

/** \brief 3C0C, Revision ID Register */
#define MTU_MC60_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064C0Cu)

/** \brief 3C0E, ECC Safety Register */
#define MTU_MC60_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064C0Eu)

/** \brief 3C10, Memory ECC Detection Register */
#define MTU_MC60_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064C10u)

/** \brief 3C12, Error Tracking Register 0 */
#define MTU_MC60_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C12u)

/** \brief 3C14, Error Tracking Register 1 */
#define MTU_MC60_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C14u)

/** \brief 3C16, Error Tracking Register 2 */
#define MTU_MC60_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C16u)

/** \brief 3C18, Error Tracking Register 3 */
#define MTU_MC60_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C18u)

/** \brief 3C1A, Error Tracking Register 4 */
#define MTU_MC60_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064C1Au)

/** \brief 3C60, Read Data and Bit Flip Register 0 */
#define MTU_MC60_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C60u)

/** \brief 3C62, Read Data and Bit Flip Register 1 */
#define MTU_MC60_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C62u)

/** \brief 3C64, Read Data and Bit Flip Register 2 */
#define MTU_MC60_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C64u)

/** \brief 3C66, Read Data and Bit Flip Register 3 */
#define MTU_MC60_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C66u)

/** \brief 3C68, Read Data and Bit Flip Register 4 */
#define MTU_MC60_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C68u)

/** \brief 3C6A, Read Data and Bit Flip Register 5 */
#define MTU_MC60_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C6Au)

/** \brief 3C6C, Read Data and Bit Flip Register 6 */
#define MTU_MC60_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C6Cu)

/** \brief 3C6E, Read Data and Bit Flip Register 7 */
#define MTU_MC60_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C6Eu)

/** \brief 3C70, Read Data and Bit Flip Register 8 */
#define MTU_MC60_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C70u)

/** \brief 3C72, Read Data and Bit Flip Register 9 */
#define MTU_MC60_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C72u)

/** \brief 3C74, Read Data and Bit Flip Register 10 */
#define MTU_MC60_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C74u)

/** \brief 3C76, Read Data and Bit Flip Register 11 */
#define MTU_MC60_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C76u)

