pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 3C78, Read Data and Bit Flip Register 12 */
#define MTU_MC60_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C78u)

/** \brief 3C7A, Read Data and Bit Flip Register 13 */
#define MTU_MC60_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C7Au)

/** \brief 3C7C, Read Data and Bit Flip Register 14 */
#define MTU_MC60_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C7Cu)

/** \brief 3C7E, Read Data and Bit Flip Register 15 */
#define MTU_MC60_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C7Eu)

/** \brief 3C80, Read Data and Bit Flip Register 16 */
#define MTU_MC60_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C80u)

/** \brief 3C82, Read Data and Bit Flip Register 17 */
#define MTU_MC60_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C82u)

/** \brief 3C84, Read Data and Bit Flip Register 18 */
#define MTU_MC60_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C84u)

/** \brief 3C86, Read Data and Bit Flip Register 19 */
#define MTU_MC60_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C86u)

/** \brief 3C88, Read Data and Bit Flip Register 20 */
#define MTU_MC60_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C88u)

/** \brief 3C8A, Read Data and Bit Flip Register 21 */
#define MTU_MC60_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C8Au)

/** \brief 3C8C, Read Data and Bit Flip Register 22 */
#define MTU_MC60_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C8Cu)

/** \brief 3C8E, Read Data and Bit Flip Register 23 */
#define MTU_MC60_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C8Eu)

/** \brief 3C90, Read Data and Bit Flip Register 24 */
#define MTU_MC60_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C90u)

/** \brief 3C92, Read Data and Bit Flip Register 25 */
#define MTU_MC60_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C92u)

/** \brief 3C94, Read Data and Bit Flip Register 26 */
#define MTU_MC60_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C94u)

/** \brief 3C96, Read Data and Bit Flip Register 27 */
#define MTU_MC60_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C96u)

/** \brief 3C98, Read Data and Bit Flip Register 28 */
#define MTU_MC60_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C98u)

/** \brief 3C9A, Read Data and Bit Flip Register 29 */
#define MTU_MC60_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C9Au)

/** \brief 3C9C, Read Data and Bit Flip Register 30 */
#define MTU_MC60_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C9Cu)

/** \brief 3C9E, Read Data and Bit Flip Register 31 */
#define MTU_MC60_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064C9Eu)

/** \brief 3CA0, Read Data and Bit Flip Register 32 */
#define MTU_MC60_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA0u)

/** \brief 3CA2, Read Data and Bit Flip Register 33 */
#define MTU_MC60_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA2u)

/** \brief 3CA4, Read Data and Bit Flip Register 34 */
#define MTU_MC60_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA4u)

/** \brief 3CA6, Read Data and Bit Flip Register 35 */
#define MTU_MC60_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA6u)

/** \brief 3CA8, Read Data and Bit Flip Register 36 */
#define MTU_MC60_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CA8u)

/** \brief 3CAA, Read Data and Bit Flip Register 37 */
#define MTU_MC60_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CAAu)

/** \brief 3CAC, Read Data and Bit Flip Register 38 */
#define MTU_MC60_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CACu)

/** \brief 3CAE, Read Data and Bit Flip Register 39 */
#define MTU_MC60_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CAEu)

/** \brief 3CB0, Read Data and Bit Flip Register 40 */
#define MTU_MC60_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB0u)

/** \brief 3CB2, Read Data and Bit Flip Register 41 */
#define MTU_MC60_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB2u)

/** \brief 3CB4, Read Data and Bit Flip Register 42 */
#define MTU_MC60_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB4u)

/** \brief 3CB6, Read Data and Bit Flip Register 43 */
#define MTU_MC60_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB6u)

/** \brief 3CB8, Read Data and Bit Flip Register 44 */
#define MTU_MC60_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CB8u)

/** \brief 3CBA, Read Data and Bit Flip Register 45 */
#define MTU_MC60_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CBAu)

/** \brief 3CBC, Read Data and Bit Flip Register 46 */
#define MTU_MC60_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CBCu)

/** \brief 3CBE, Read Data and Bit Flip Register 47 */
#define MTU_MC60_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CBEu)

/** \brief 3CC0, Read Data and Bit Flip Register 48 */
#define MTU_MC60_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC0u)

/** \brief 3CC2, Read Data and Bit Flip Register 49 */
#define MTU_MC60_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC2u)

/** \brief 3CC4, Read Data and Bit Flip Register 50 */
#define MTU_MC60_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC4u)

/** \brief 3CC6, Read Data and Bit Flip Register 51 */
#define MTU_MC60_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC6u)

/** \brief 3CC8, Read Data and Bit Flip Register 52 */
#define MTU_MC60_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CC8u)

/** \brief 3CCA, Read Data and Bit Flip Register 53 */
#define MTU_MC60_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CCAu)

/** \brief 3CCC, Read Data and Bit Flip Register 54 */
#define MTU_MC60_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CCCu)

