pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 40CC, Read Data and Bit Flip Register 54 */
#define MTU_MC64_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650CCu)

/** \brief 40CE, Read Data and Bit Flip Register 55 */
#define MTU_MC64_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650CEu)

/** \brief 40D0, Read Data and Bit Flip Register 56 */
#define MTU_MC64_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D0u)

/** \brief 40D2, Read Data and Bit Flip Register 57 */
#define MTU_MC64_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D2u)

/** \brief 40D4, Read Data and Bit Flip Register 58 */
#define MTU_MC64_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D4u)

/** \brief 40D6, Read Data and Bit Flip Register 59 */
#define MTU_MC64_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D6u)

/** \brief 40D8, Read Data and Bit Flip Register 60 */
#define MTU_MC64_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650D8u)

/** \brief 40DA, Read Data and Bit Flip Register 61 */
#define MTU_MC64_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650DAu)

/** \brief 40DC, Read Data and Bit Flip Register 62 */
#define MTU_MC64_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650DCu)

/** \brief 40DE, Read Data and Bit Flip Register 63 */
#define MTU_MC64_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650DEu)

/** \brief 40E0, Read Data and Bit Flip Register 64 */
#define MTU_MC64_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650E0u)

/** \brief 40E2, Read Data and Bit Flip Register 65 */
#define MTU_MC64_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650E2u)

/** \brief 40E4, Read Data and Bit Flip Register 66 */
#define MTU_MC64_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650E4u)

/** \brief 40EE, Alarm Sources Configuration Register */
#define MTU_MC64_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00650EEu)

/** \brief 40F0, SSH Safety Faults Status Register  */
#define MTU_MC64_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00650F0u)

/** \brief 40F2, Error Information Register 0 */
#define MTU_MC64_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650F2u)

/** \brief 40F4, Error Information Register 1 */
#define MTU_MC64_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650F4u)

/** \brief 40F6, Error Information Register 2 */
#define MTU_MC64_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650F6u)

/** \brief 40F8, Error Information Register 3 */
#define MTU_MC64_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650F8u)

/** \brief 40FA, Error Information Register 4 */
#define MTU_MC64_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00650FAu)

/** \brief 4100, Configuration Registers */
#define MTU_MC65_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065100u)

/** \brief 4102, Configuration Register 1 */
#define MTU_MC65_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065102u)

/** \brief 4104, MBIST Control Register */
#define MTU_MC65_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065104u)

/** \brief 4106, Status Register */
#define MTU_MC65_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065106u)

/** \brief 4108, Range Register, single address mode */
#define MTU_MC65_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065108u)

/** \brief 410C, Revision ID Register */
#define MTU_MC65_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006510Cu)

/** \brief 410E, ECC Safety Register */
#define MTU_MC65_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006510Eu)

/** \brief 4110, Memory ECC Detection Register */
#define MTU_MC65_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065110u)

/** \brief 4112, Error Tracking Register 0 */
#define MTU_MC65_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065112u)

/** \brief 4114, Error Tracking Register 1 */
#define MTU_MC65_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065114u)

/** \brief 4116, Error Tracking Register 2 */
#define MTU_MC65_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065116u)

/** \brief 4118, Error Tracking Register 3 */
#define MTU_MC65_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065118u)

/** \brief 411A, Error Tracking Register 4 */
#define MTU_MC65_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006511Au)

/** \brief 4160, Read Data and Bit Flip Register 0 */
#define MTU_MC65_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065160u)

/** \brief 4162, Read Data and Bit Flip Register 1 */
#define MTU_MC65_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065162u)

/** \brief 4164, Read Data and Bit Flip Register 2 */
#define MTU_MC65_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065164u)

/** \brief 4166, Read Data and Bit Flip Register 3 */
#define MTU_MC65_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065166u)

/** \brief 4168, Read Data and Bit Flip Register 4 */
#define MTU_MC65_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065168u)

/** \brief 416A, Read Data and Bit Flip Register 5 */
#define MTU_MC65_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006516Au)

/** \brief 416C, Read Data and Bit Flip Register 6 */
#define MTU_MC65_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006516Cu)

/** \brief 416E, Read Data and Bit Flip Register 7 */
#define MTU_MC65_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006516Eu)

/** \brief 4170, Read Data and Bit Flip Register 8 */
#define MTU_MC65_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065170u)

/** \brief 4172, Read Data and Bit Flip Register 9 */
#define MTU_MC65_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065172u)

