pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMtu_reg.h
/** \brief 5D70, Read Data and Bit Flip Register 8 */
#define MTU_MC93_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D70u)

/** \brief 5D72, Read Data and Bit Flip Register 9 */
#define MTU_MC93_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D72u)

/** \brief 5D74, Read Data and Bit Flip Register 10 */
#define MTU_MC93_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D74u)

/** \brief 5D76, Read Data and Bit Flip Register 11 */
#define MTU_MC93_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D76u)

/** \brief 5D78, Read Data and Bit Flip Register 12 */
#define MTU_MC93_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D78u)

/** \brief 5D7A, Read Data and Bit Flip Register 13 */
#define MTU_MC93_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D7Au)

/** \brief 5D7C, Read Data and Bit Flip Register 14 */
#define MTU_MC93_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D7Cu)

/** \brief 5D7E, Read Data and Bit Flip Register 15 */
#define MTU_MC93_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D7Eu)

/** \brief 5D80, Read Data and Bit Flip Register 16 */
#define MTU_MC93_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D80u)

/** \brief 5D82, Read Data and Bit Flip Register 17 */
#define MTU_MC93_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D82u)

/** \brief 5D84, Read Data and Bit Flip Register 18 */
#define MTU_MC93_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D84u)

/** \brief 5D86, Read Data and Bit Flip Register 19 */
#define MTU_MC93_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D86u)

/** \brief 5D88, Read Data and Bit Flip Register 20 */
#define MTU_MC93_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D88u)

/** \brief 5D8A, Read Data and Bit Flip Register 21 */
#define MTU_MC93_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D8Au)

/** \brief 5D8C, Read Data and Bit Flip Register 22 */
#define MTU_MC93_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D8Cu)

/** \brief 5D8E, Read Data and Bit Flip Register 23 */
#define MTU_MC93_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D8Eu)

/** \brief 5D90, Read Data and Bit Flip Register 24 */
#define MTU_MC93_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D90u)

/** \brief 5D92, Read Data and Bit Flip Register 25 */
#define MTU_MC93_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D92u)

/** \brief 5D94, Read Data and Bit Flip Register 26 */
#define MTU_MC93_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D94u)

/** \brief 5D96, Read Data and Bit Flip Register 27 */
#define MTU_MC93_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D96u)

/** \brief 5D98, Read Data and Bit Flip Register 28 */
#define MTU_MC93_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D98u)

/** \brief 5D9A, Read Data and Bit Flip Register 29 */
#define MTU_MC93_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D9Au)

/** \brief 5D9C, Read Data and Bit Flip Register 30 */
#define MTU_MC93_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D9Cu)

/** \brief 5D9E, Read Data and Bit Flip Register 31 */
#define MTU_MC93_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066D9Eu)

/** \brief 5DA0, Read Data and Bit Flip Register 32 */
#define MTU_MC93_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DA0u)

/** \brief 5DA2, Read Data and Bit Flip Register 33 */
#define MTU_MC93_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DA2u)

/** \brief 5DA4, Read Data and Bit Flip Register 34 */
#define MTU_MC93_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DA4u)

/** \brief 5DA6, Read Data and Bit Flip Register 35 */
#define MTU_MC93_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DA6u)

/** \brief 5DA8, Read Data and Bit Flip Register 36 */
#define MTU_MC93_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DA8u)

/** \brief 5DAA, Read Data and Bit Flip Register 37 */
#define MTU_MC93_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DAAu)

/** \brief 5DAC, Read Data and Bit Flip Register 38 */
#define MTU_MC93_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DACu)

/** \brief 5DAE, Read Data and Bit Flip Register 39 */
#define MTU_MC93_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DAEu)

/** \brief 5DB0, Read Data and Bit Flip Register 40 */
#define MTU_MC93_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DB0u)

/** \brief 5DB2, Read Data and Bit Flip Register 41 */
#define MTU_MC93_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DB2u)

/** \brief 5DB4, Read Data and Bit Flip Register 42 */
#define MTU_MC93_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DB4u)

/** \brief 5DB6, Read Data and Bit Flip Register 43 */
#define MTU_MC93_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DB6u)

/** \brief 5DB8, Read Data and Bit Flip Register 44 */
#define MTU_MC93_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DB8u)

/** \brief 5DBA, Read Data and Bit Flip Register 45 */
#define MTU_MC93_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DBAu)

/** \brief 5DBC, Read Data and Bit Flip Register 46 */
#define MTU_MC93_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DBCu)

/** \brief 5DBE, Read Data and Bit Flip Register 47 */
#define MTU_MC93_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DBEu)

/** \brief 5DC0, Read Data and Bit Flip Register 48 */
#define MTU_MC93_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DC0u)

/** \brief 5DC2, Read Data and Bit Flip Register 49 */
#define MTU_MC93_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DC2u)

/** \brief 5DC4, Read Data and Bit Flip Register 50 */
#define MTU_MC93_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DC4u)

/** \brief 5DC6, Read Data and Bit Flip Register 51 */
#define MTU_MC93_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DC6u)

